### Prepared by Abhishek Kumar
### https://www.linkedin.com/in/abhishek-kumar-442337b2/

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
# To get multiple outputs in the same cell

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

%matplotlib inline

In [3]:
salary = [['1','Abhishek Kumar','AIML', 'Machine Learning Engineer','M', 'Y', '04051990', 1121000],
          ['2','Arjun Kumar','DM', 'Tech Lead','M', 'Y', '09031992', 109000],
          ['3','Vivek Raj','DM', 'Devops Engineer','M', 'N', np.NaN , 827000],
          ['4','Mika Singh','DM', 'Data Analyst','F', 'Y', '15101991',  929000],
          ['5','Anusha Yenduri','AIML', 'Data Scientist','M', 'Y', '01011989',  921000],
          ['6','Ritesh Srivastava','AIML', 'Data Engineer','M', 'Y', np.NaN, 785000]]

columns_name=['Emp_Id','Emp_Name','Department','Role','Gender', 'WFH Status', 'DOB', 'Salary']

emp_df = pd.DataFrame(salary,columns=columns_name)
emp_df

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,929000
4,5,Anusha Yenduri,AIML,Data Scientist,M,Y,01011989,921000
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000

#### DataFrame.nunique(self, axis=0, dropna=True)

Count distinct observations over requested axis.

1. Parameters - axis{0 or ‘index’, 1 or ‘columns’}, default 0 : The axis to use. 0 or ‘index’ for row-wise, 1 or ‘columns’ for column-wise.
2. dropna - bool, default True : Don’t include NaN in the counts.
3. Returns - Series : Return Series with number of distinct observations. Can ignore NaN values.

In [4]:
# Setup : DataFrame creation
emp_df_1 = emp_df.copy()
emp_df_1

emp_df_1.nunique()
emp_df_1.nunique()[0]
emp_df_1.nunique().max()
emp_df_1.nunique().values
emp_df_1.nunique().tolist()

emp_df_1.nunique(axis=1)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,929000
4,5,Anusha Yenduri,AIML,Data Scientist,M,Y,01011989,921000
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000

Emp_Id        6
Emp_Name      6
Department    2
Role          6
Gender        2
WFH Status    2
DOB           4
Salary        6
dtype: int64

6

6

array([6, 6, 2, 6, 2, 2, 4, 6], dtype=int64)

[6, 6, 2, 6, 2, 2, 4, 6]

0    8
1    8
2    7
3    8
4    8
5    7
dtype: int64

#### DataFrame.count(self, axis=0, level=None, numeric_only=False)

1. Count non-NA cells for each column or row.
2. The values None, NaN, NaT, and optionally numpy.inf (depending on pandas.options.mode.use_inf_as_na) are considered NA.
3. Returns - Series or DataFrame : For each column/row the number of non-NA/null entries. If level is specified returns a DataFrame.

In [5]:
# Setup : DataFrame creation
emp_df_2 = emp_df.copy()
emp_df_2

emp_df_2.count(axis=0)

emp_df_2.count(axis=1)

,Emp_Id,Emp_Name,Department,Role,Gender,WFH Status,DOB,Salary
0,1,Abhishek Kumar,AIML,Machine Learning Engineer,M,Y,04051990,1121000
1,2,Arjun Kumar,DM,Tech Lead,M,Y,09031992,109000
2,3,Vivek Raj,DM,Devops Engineer,M,N,NaN,827000
3,4,Mika Singh,DM,Data Analyst,F,Y,15101991,929000
4,5,Anusha Yenduri,AIML,Data Scientist,M,Y,01011989,921000
5,6,Ritesh Srivastava,AIML,Data Engineer,M,Y,NaN,785000

Emp_Id        6
Emp_Name      6
Department    6
Role          6
Gender        6
WFH Status    6
DOB           4
Salary        6
dtype: int64

0    8
1    8
2    7
3    8
4    8
5    7
dtype: int64